In [1]:
import numpy as np 
import pandas as pd

In [6]:
df=pd.DataFrame([
            [10,15,11,12],
            [45,66,23,14],
            [22,33,44,55],
            [78,88,96,45]],
             columns=['osa','java','se','ds'])
df

   osa  java  se  ds
0   10    15  11  12
1   45    66  23  14
2   22    33  44  55
3   78    88  96  45

In [10]:
df.sum()

osa     155
java    202
se      174
ds      126
dtype: int64

In [12]:
df.min()

osa     10
java    15
se      11
ds      12
dtype: int64

In [11]:
df.max()

osa     78
java    88
se      96
ds      55
dtype: int64

In [13]:
df.mean()

osa     38.75
java    50.50
se      43.50
ds      31.50
dtype: float64

In [14]:
df.count()

osa     4
java    4
se      4
ds      4
dtype: int64

In [15]:
df.median()

osa     33.5
java    49.5
se      33.5
ds      29.5
dtype: float64

In [16]:
df.agg(['sum','min','max'])

     osa  java   se   ds
sum  155   202  174  126
min   10    15   11   12
max   78    88   96   55

In [17]:
from pandas import DataFrame
df = DataFrame(
              [
                ['Aryan','Singh','Full-time','administration',2,2000],
                ['Rohan','Agarval','intern','technical',3,5000],
                ['Riya','Shah','Full-time','administration',5,10000],
                ['Yash','Bhatia','Part-time','technical',7,10000],
                ['Siddant','Khanna','Full-time','Management',6,20000],
              ]
            , columns=['FIRST NAME','LAST NAME','TYPE','DEPARTMENT','YOE','SALARY']
              )
df

  FIRST NAME LAST NAME       TYPE      DEPARTMENT  YOE  SALARY
0      Aryan     Singh  Full-time  administration    2    2000
1      Rohan   Agarval     intern       technical    3    5000
2       Riya      Shah  Full-time  administration    5   10000
3       Yash    Bhatia  Part-time       technical    7   10000
4    Siddant    Khanna  Full-time      Management    6   20000

In [18]:
df.groupby(['TYPE']).mean()

                YOE        SALARY
TYPE
Full-time  4.333333  10666.666667
Part-time  7.000000  10000.000000
intern     3.000000   5000.000000

In [19]:
df.groupby(['TYPE']).min()

          FIRST NAME LAST NAME  DEPARTMENT  YOE  SALARY
TYPE
Full-time      Aryan    Khanna  Management    2    2000
Part-time       Yash    Bhatia   technical    7   10000
intern         Rohan   Agarval   technical    3    5000

In [20]:
df.groupby(['TYPE','DEPARTMENT']).mean()

                          YOE   SALARY
TYPE      DEPARTMENT
Full-time Management      6.0  20000.0
          administration  3.5   6000.0
Part-time technical       7.0  10000.0
intern    technical       3.0   5000.0

In [22]:
df.groupby(['TYPE','DEPARTMENT']).min()

                         FIRST NAME LAST NAME  YOE  SALARY
TYPE      DEPARTMENT
Full-time Management        Siddant    Khanna    6   20000
          administration      Aryan      Shah    2    2000
Part-time technical            Yash    Bhatia    7   10000
intern    technical           Rohan   Agarval    3    5000